## Production: buckets
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**❌ &nbsp; Terraform Plan:** `failed`
**❌ &nbsp; Conftest:** `failed` 

<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.log_bucket.data.aws_iam_policy_document.combined will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "combined" {
      + id                      = (known after apply)
      + json                    = (known after apply)
      + minified_json           = (known after apply)
      + source_policy_documents = (known after apply)
    }

  # module.log_bucket.data.aws_iam_policy_document.deny_insecure_transport will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "deny_insecure_transport" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + effect    = "Deny"
          + resources = [
              + "arn:aws:s3:::cds-data-lake-bucket-logs-production",
              + "arn:aws:s3:::cds-data-lake-bucket-logs-production/*",
            ]
          + sid       = "denyInsecureTransport"

          + condition {
              + test     = "Bool"
              + values   = [
                  + "false",
                ]
              + variable = "aws:SecureTransport"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "*"
            }
        }
    }

  # module.log_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "cds-data-lake-bucket-logs-production"
        tags                        = {
            "CostCentre" = "PlatformDataLake"
            "Critical"   = "true"
            "Terraform"  = "true"
        }
        # (13 unchanged attributes hidden)

      ~ lifecycle_rule {
          ~ id                                     = "NGZmNDVkY2QtZWE3Ny00MWUxLTk1N2QtYTQ5MjM0ZTgxNmZj" -> "expire_all"
            tags                                   = {}
            # (3 unchanged attributes hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> true
                # (2 unchanged attributes hidden)
            }
        }
      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = 7
          + enabled                                = true
          + id                                     = "remove_noncurrent_versions"
        }

        # (4 unchanged blocks hidden)
    }

  # module.log_bucket.aws_s3_bucket_policy.this will be updated in-place
  ~ resource "aws_s3_bucket_policy" "this" {
        id     = "cds-data-lake-bucket-logs-production"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:*"
                      - Condition = {
                          - Bool = {
                              - "aws:SecureTransport" = "false"
                            }
                        }
                      - Effect    = "Deny"
                      - Principal = "*"
                      - Resource  = [
                          - "arn:aws:s3:::cds-data-lake-bucket-logs-production/*",
                          - "arn:aws:s3:::cds-data-lake-bucket-logs-production",
                        ]
                      - Sid       = "denyInsecureTransport"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 0 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with module.log_bucket.aws_s3_bucket.this,
  on .terraform/modules/log_bucket/S3_log_bucket/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_server_side_encryption_configuration resource instead

(and 2 more similar warnings elsewhere)

Error: Invalid function argument

  on .terraform/modules/curated_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
  65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
    ├────────────────
    │ lifecycle_rule.value is object with 4 attributes

Invalid value for "inputMap" parameter: must have map or object type.

Error: Invalid function argument

  on .terraform/modules/raw_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
  65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
    ├────────────────
    │ lifecycle_rule.value is object with 4 attributes

Invalid value for "inputMap" parameter: must have map or object type.

Error: Invalid function argument

  on .terraform/modules/raw_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
  65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
    ├────────────────
    │ lifecycle_rule.value is object with 3 attributes

Invalid value for "inputMap" parameter: must have map or object type.

Error: Invalid function argument

  on .terraform/modules/transformed_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
  65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
    ├────────────────
    │ lifecycle_rule.value is object with 4 attributes

Invalid value for "inputMap" parameter: must have map or object type.
[0;90m15:30:00.762 [0m[0;31mERROR  [0mterraform invocation failed in ./.terragrunt-cache/y9zTaCFHP_Fz58OyeHxbVKgTDUs/tTxThv39VHR3qEuH_mdSdxSC1o0/buckets
[0;90m15:30:00.763 [0m[0;31mERROR  [0merror occurred:

* Failed to execute "terraform plan -no-color -input=false -out=plan.tfplan" in ./.terragrunt-cache/y9zTaCFHP_Fz58OyeHxbVKgTDUs/tTxThv39VHR3qEuH_mdSdxSC1o0/buckets
  
  Error: Invalid function argument
  
    on .terraform/modules/curated_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
    65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
      ├────────────────
      │ lifecycle_rule.value is object with 4 attributes
  
  Invalid value for "inputMap" parameter: must have map or object type.
  
  Error: Invalid function argument
  
    on .terraform/modules/raw_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
    65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
      ├────────────────
      │ lifecycle_rule.value is object with 4 attributes
  
  Invalid value for "inputMap" parameter: must have map or object type.
  
  Error: Invalid function argument
  
    on .terraform/modules/raw_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
    65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
      ├────────────────
      │ lifecycle_rule.value is object with 3 attributes
  
  Invalid value for "inputMap" parameter: must have map or object type.
  
  Error: Invalid function argument
  
    on .terraform/modules/transformed_bucket/S3/main.tf line 65, in resource "aws_s3_bucket" "this":
    65:         for_each = length(keys(lookup(lifecycle_rule.value, "transition", []))) == 0 ? [] : lookup(lifecycle_rule.value, "transition", [])
      ├────────────────
      │ lifecycle_rule.value is object with 4 attributes
  
  Invalid value for "inputMap" parameter: must have map or object type.
  
  exit status 1


```

</details>

